%*******************************************************************************
% 製品名　　 : XXXX
% 車両コード : XXXX
% フェーズ　 : XXXX
% MATLABリリース : R2021aSP1(Update6)
% envVer　　　　 : X.XX
%
% Title : XXXX
% File  : XXXX.m
% ===========================================================================
%  (株)東海理化
% ---------------------------------------------------------------------------
%  このプログラムの著作権 及び このプログラムに関する技術は(株)東海理化がその
%  知的財産権を所有しており、所有者の事前の許可なくその全部又は一部を問わず、
%  第三者に開示してはならない。
%  Copyright(c)20XX TOKAI RIKA CO.,LTD.  All Rights Reserved
% ===========================================================================
% ----------------------------------------------------------------------------
% [備考]
% 
% 
% ----------------------------------------------------------------------------
% [変更履歴] (最新は上の段に追記してください)
% V1.00(YYYY/MM/DD)------------------------------------------- X.Xxxxxx
% ・新規作成
%
% ----------------------------------------------------------------------------
% [テンプレート情報]  （本テンプレート使用時は本項は変更しないでください）
% タイトル　 : 初期設定スクリプトテンプレート（部品モデル用）
% ファイル　 : ProductParts_set.m
% バージョン : V2.10
% 備考　　　 : 
%*******************************************************************************

%%
% 変数のクリア
clear all;

% ユーザー設定
bootstrap_modelTop = 'Sample';              % 製品名
bootstrap_modelSuffix = 'PartsA';           % 部品名

bootstrap_configType = 3;             % コンフィギュレーション選択（0:スクリプト設定方式、1:コンフィギュレーション参照方式、2:紐づけスクリプト参照方式、3:SLDD参照方式）
bootstrap_selectType = 0;             % DD選択（0:Excel、1:Mfile、0/1以外:何もしない）
bootstrap_logType = 0;                % ログファイル出力（1:on、0:off）

bootstrap_packageFile = 'tr_pkg.xlsx'; % 定義体ファイル名

bootstrap_viewWarning = 0;            % 個別定義のDDがない場合の警告表示有無(1:表示する、0:表示しない)

% 処理を実行
trse_bootstrap_parts;

% 変数のクリア
clear bootstrap_modelTop;
clear bootstrap_modelSuffix;
clear bootstrap_configType;
clear bootstrap_selectType;
clear bootstrap_logType;
clear bootstrap_packageFile;
clear bootstrap_viewWarning;

%***** End of file *****
